#include "animacoes.h"

const uint8_t numbers[4][NUM_PIXELS] = {
    // Carinha :) (Planta Saudável)
    {0, 1, 1, 1, 0,
     1, 0, 0, 0, 1,
     0, 0, 0, 0, 0,
     0, 0, 0, 0, 0,
     0, 1, 0, 1, 0},

    // Carinha :| (Alerta)
    {0, 0, 0, 0, 0,
     1, 1, 1, 1, 1,
     0, 0, 0, 0, 0,
     0, 0, 0, 0, 0,
     0, 1, 0, 1, 0},

    // Carinha :( (Crítico)
    {1, 0, 0, 0, 1,
     0, 1, 1, 1, 0,
     0, 0, 0, 0, 0,
     0, 0, 0, 0, 0,
     0, 1, 0, 1, 0},

    // Sem carinha (Cuidado)
    {0, 1, 0, 1, 0,
     0, 0, 0, 0, 0,
     0, 0, 1, 0, 0,
     0, 0, 1, 0, 0,
     0, 1, 1, 1, 0}
};